// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива. [3 7 22 2 78] -> 76

Random rand = new Random();
double temp = Math.Round(rand.Next(-10, 10) + rand.NextDouble(), 3);
System.Console.WriteLine(temp);